In [2]:
import numpy as np
import pandas as pd

# 7.1 handling missing data

- NA data may either be data that does not exist or that exists but was not observed (through problems with data collection, for example). 

- how  = all will drop. rows(by default) with all the. columns. are missing

- thres  specify how many to drop

- fillna fills na
    - Calling fillna with a dictionary, you can use a different fill value for each column:

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [11]:
data.dropna()
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -1.130249       NaN       NaN
1 -0.284456       NaN       NaN
2  0.425764       NaN  0.229131
3  0.315094       NaN  1.518243
4 -0.282457  0.943277  1.747993
5 -1.473028  0.627957  0.569526
6  0.753525  0.632472  2.241862

In [18]:
df.dropna()

          0         1         2
4 -0.282457  0.943277  1.747993
5 -1.473028  0.627957  0.569526
6  0.753525  0.632472  2.241862

In [19]:
df.dropna(thresh=2)

          0         1         2
2  0.425764       NaN  0.229131
3  0.315094       NaN  1.518243
4 -0.282457  0.943277  1.747993
5 -1.473028  0.627957  0.569526
6  0.753525  0.632472  2.241862

In [20]:
df.fillna(0)

          0         1         2
0 -1.130249  0.000000  0.000000
1 -0.284456  0.000000  0.000000
2  0.425764  0.000000  0.229131
3  0.315094  0.000000  1.518243
4 -0.282457  0.943277  1.747993
5 -1.473028  0.627957  0.569526
6  0.753525  0.632472  2.241862

In [22]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.130249  0.500000  0.000000
1 -0.284456  0.500000  0.000000
2  0.425764  0.500000  0.229131
3  0.315094  0.500000  1.518243
4 -0.282457  0.943277  1.747993
5 -1.473028  0.627957  0.569526
6  0.753525  0.632472  2.241862

# 7.2 Data Transformation
So far in this chapter we’ve been concerned with handling missing data. Filtering,
cleaning, and other transformations are another class of important operations.

In [24]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"],"ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [29]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}

In [31]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [33]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [35]:
 data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=["Ohio", "Colorado", "New York"],
                     columns=["one", "two", "three", "four"])
    
data.index.map(lambda x:  x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [43]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [46]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [47]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [49]:
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [53]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data

            0         1         2         3
0   -0.462041 -0.433599  2.990803 -0.993114
1   -0.318917 -0.705947 -1.001425 -1.196843
2   -0.687593 -1.735382  0.107407  1.656800
3   -0.121349  0.889193  1.346254  0.130286
4   -0.763126  0.058559  0.964553 -0.387161
..        ...       ...       ...       ...
995 -0.970201  1.617887  0.740745  2.428628
996  0.956496  0.449080 -0.158726 -1.903090
997 -0.343351 -0.709464  0.591141  0.283593
998  1.351674 -1.222261  0.678433  1.838283
999  1.581444 -0.020452  1.143455 -0.798510

[1000 rows x 4 columns]

In [54]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.059421    -0.044807    -0.036291    -0.023745
std       0.950954     0.981495     0.979649     1.010669
min      -2.997735    -3.065670    -3.101933    -3.034156
25%      -0.590628    -0.694495    -0.730551    -0.710440
50%       0.101709     0.005506    -0.042757    -0.072992
75%       0.705727     0.608925     0.643339     0.699503
max       2.932513     3.370667     3.057947     2.756766

In [55]:
col = data[2]
col[col.abs() > 3]

27   -3.101933
80    3.057947
Name: 2, dtype: float64

In [57]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [60]:
sampler = np.random.permutation(5)
sampler

array([4, 0, 1, 3, 2])

In [ ]:
df.iloc[sampler]

In [62]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],"data1": range(6)})

In [64]:
dummies = pd.get_dummies(df['key'])
df = df[['data1']].join(dummies)

In [65]:
df

   data1  a  b  c
0      0  0  1  0
1      1  0  1  0
2      2  1  0  0
3      3  0  0  1
4      4  1  0  0
5      5  0  1  0

# 7.4 String Manipulation